## 🏗️ Infrastructure Preview ✅

**Environment:** `staging`

<details>
<summary>Preview Output</summary>

```

Previewing Azure resource changes (azd provision --preview)
This is a preview. No changes will be applied to your Azure resources.

Retrieving subscriptions...
Reading subscription and location from environment...
Subscription: AutoAuth (46c8d580-4e4e-43b3-b3db-4a2daea037b1)
Location: East US

Generating terraform backend config file...
[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mUpgrading modules...[0m
- ai_foundry in modules/ai
- ai_foundry_voice_live in modules/ai
- appconfig in modules/appconfig
[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/random versions matching "~> 3.0"...
- Finding latest version of hashicorp/time...
- Finding azure/azapi versions matching "~> 2.0"...
- Finding hashicorp/azurerm versions matching "~> 4.0"...
- Finding hashicorp/azuread versions matching "~> 3.0"...
- Installing hashicorp/time v0.13.1...
- Installed hashicorp/time v0.13.1 (signed by HashiCorp)
- Installing azure/azapi v2.8.0...
- Installed azure/azapi v2.8.0 (signed by a HashiCorp partner, key ID [0m[1m6F0B91BDE98478CF[0m[0m)
- Installing hashicorp/azurerm v4.57.0...
- Installed hashicorp/azurerm v4.57.0 (signed by HashiCorp)
- Installing hashicorp/azuread v3.7.0...
- Installed hashicorp/azuread v3.7.0 (signed by HashiCorp)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[0m[1mrandom_string.resource_token: Refreshing state... [id=x1roluwb][0m
[0m[1mrandom_password.cosmos_admin: Refreshing state... [id=none][0m
[0m[1mdata.azuread_client_config.current: Reading...[0m[0m
[0m[1mdata.azuread_client_config.current: Read complete after 0s [id=16b3c013-d300-468d-ac64-7eda0820b6d3-dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938-2c0711ae-679a-4a27-8360-a821120d8da1][0m
[0m[1mazurerm_resource_group.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging][0m
[0m[1mazurerm_email_communication_service.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb][0m
[0m[1mazurerm_user_assigned_identity.frontend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-frontend-x1roluwb][0m
[0m[1mazurerm_key_vault.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.KeyVault/vaults/kv-x1roluwb][0m
[0m[1mazurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.OperationalInsights/workspaces/log-x1roluwb][0m
[0m[1mazurerm_user_assigned_identity.backend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-backend-x1roluwb][0m
[0m[1mazurerm_container_registry.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ContainerRegistry/registries/crartaudioagentx1roluwb][0m
[0m[1mazapi_resource.mongoCluster: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb][0m
[0m[1mazapi_resource.acs: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb][0m
[0m[1mazapi_resource.redisEnterprise: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb][0m
[0m[1mmodule.ai_foundry.azapi_resource.ai_foundry_account: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb][0m
[0m[1mazurerm_storage_account.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb][0m
[0m[1mmodule.ai_foundry_voice_live[0].azapi_resource.ai_foundry_account: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb][0m
[0m[1mazurerm_email_communication_service_domain.managed: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain][0m
[0m[1mazurerm_application_insights.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb][0m
[0m[1mazurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/managedEnvironments/cae-artaudioagent-staging-x1roluwb][0m
[0m[1mazurerm_role_assignment.acr_principal_pull: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ContainerRegistry/registries/crartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/91283890-9bb7-5613-5396-a19ee5514d09][0m
[0m[1mazurerm_role_assignment.acr_principal_push: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ContainerRegistry/registries/crartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/c630185b-a3a0-1c94-0a11-d4b22c73cdaa][0m
[0m[1mazurerm_role_assignment.acr_frontend_pull: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ContainerRegistry/registries/crartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/c20f72e1-5deb-52a2-298c-134dff0b1b85][0m
[0m[1mazurerm_role_assignment.acr_backend_pull: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ContainerRegistry/registries/crartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/3817201e-7e96-dc98-ee77-74b700e9f9d2][0m
[0m[1mazapi_resource.mongo_firewall_all[0]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/firewallRules/allowAll][0m
[0m[1mazapi_resource.cosmos_backend_db_user: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/7ce170e7-9b96-460d-b073-2ee67b3c4ef2][0m
[0m[1mazapi_resource.cosmos_principal_user: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/2c0711ae-679a-4a27-8360-a821120d8da1][0m
[0m[1mazurerm_eventgrid_system_topic.acs: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.EventGrid/systemTopics/eg-topic-acs-x1roluwb][0m
[0m[1mazapi_resource_action.acs_list_keys: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb/listKeys][0m
[0m[1mazurerm_monitor_diagnostic_setting.acs_diagnostics: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb|acs-artaudioagent-staging-x1roluwb-diagnostics][0m
[0m[1mmodule.ai_foundry.azurerm_cognitive_deployment.model["gpt-4o"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/deployments/gpt-4o][0m
[0m[1mmodule.ai_foundry.azapi_resource.ai_foundry_project: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/projects/aif-artaudioagent-x1roluwb-proj][0m
[0m[1mmodule.ai_foundry.azurerm_cognitive_deployment.model["o3-mini"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/deployments/o3-mini][0m
[0m[1mmodule.ai_foundry.azurerm_cognitive_deployment.model["gpt-4.1-mini"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/deployments/gpt-4.1-mini][0m
[0m[1mmodule.ai_foundry.azurerm_cognitive_deployment.model["gpt-4.1-nano"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/deployments/gpt-4.1-nano][0m
[0m[1mazurerm_email_communication_service_domain_sender_username.default: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain/senderUsernames/noreply][0m
[0m[1mazurerm_communication_service_email_domain_association.example: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb|/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain][0m
[0m[1mazurerm_role_assignment.keyvault_admin: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.KeyVault/vaults/kv-x1roluwb/providers/Microsoft.Authorization/roleAssignments/a7997943-0850-21dc-a1f9-43657dad131c][0m
[0m[1mazurerm_role_assignment.keyvault_backend_secrets: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.KeyVault/vaults/kv-x1roluwb/providers/Microsoft.Authorization/roleAssignments/4006b974-bd02-244f-5ac9-743dfa154904][0m
[0m[1mazapi_resource.redisDatabase: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default][0m
[0m[1mmodule.ai_foundry_voice_live[0].azapi_resource.ai_foundry_project: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb/projects/avl-artaudioagent-x1roluwb-proj][0m
[0m[1mmodule.ai_foundry_voice_live[0].azurerm_cognitive_deployment.model["gpt-4o-transcribe"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb/deployments/gpt-4o-transcribe][0m
[0m[1mmodule.ai_foundry_voice_live[0].azurerm_cognitive_deployment.model["gpt-realtime"]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb/deployments/gpt-realtime][0m
[0m[1mazurerm_role_assignment.ai_foundry_account_role_for_deployment_principal: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/7366b45b-0310-8ddc-65ad-ef8d77b44a51][0m
[0m[1mazurerm_role_assignment.ai_foundry_account_role_for_backend_container: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/e495fbcf-1f9a-a0c2-b3b0-b3279512bf51][0m
[0m[1mazurerm_monitor_diagnostic_setting.ai_foundry_account: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/aifartaudioagentx1roluwb|aifartaudioagentx1roluwb][0m
[0m[1mmodule.ai_foundry.time_sleep.wait_project_identities: Refreshing state... [id=2025-12-12T02:57:29Z][0m
[0m[1mazapi_resource.principalRedisUser: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/principalaccess][0m
[0m[1mazapi_resource.backendRedisUser: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/backendaccess][0m
[0m[1mmodule.ai_foundry_voice_live[0].time_sleep.wait_project_identities: Refreshing state... [id=2025-12-12T02:57:42Z][0m
[0m[1mazurerm_key_vault_secret.cosmos_admin_password: Refreshing state... [id=https://kv-x1roluwb.vault.azure.net/secrets/cosmos-admin-password/74b8c884c5444139a72cc7dfa7873485][0m
[0m[1mazurerm_key_vault_secret.cosmos_connection_string: Refreshing state... [id=https://kv-x1roluwb.vault.azure.net/secrets/cosmos-connection-string/048dbc004ffd42fbb7882301aa8440e9][0m
[0m[1mazurerm_key_vault_secret.cosmos_entra_connection_string: Refreshing state... [id=https://kv-x1roluwb.vault.azure.net/secrets/cosmos-entra-connection-string/56de5720262d4cf7b01c0f095e0fd62f][0m
[0m[1mmodule.ai_foundry.time_sleep.wait_rbac: Refreshing state... [id=2025-12-12T02:58:43Z][0m
[0m[1mmodule.ai_foundry_voice_live[0].time_sleep.wait_rbac: Refreshing state... [id=2025-12-12T02:58:52Z][0m
[0m[1mazurerm_key_vault_secret.acs_connection_string: Refreshing state... [id=https://kv-x1roluwb.vault.azure.net/secrets/acs-connection-string/0f486598f3a1472a8e9c66fe520e79f0][0m
[0m[1mazurerm_role_assignment.ai_foundry_voice_live_account_role_for_backend_container[0]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/8c1ba701-628b-ac53-bd1c-56df57690c2d][0m
[0m[1mmodule.appconfig.azurerm_app_configuration.main: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.AppConfiguration/configurationStores/appconfig-staging-x1roluwb][0m
[0m[1mazurerm_role_assignment.ai_foundry_voice_live_account_role_for_deployment_principal[0]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb/providers/Microsoft.Authorization/roleAssignments/bb74194b-7918-fe52-2bc4-e1b3584ead9e][0m
[0m[1mazurerm_monitor_diagnostic_setting.ai_foundry_voice_live_account[0]: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.CognitiveServices/accounts/avlartaudioagentx1roluwb|avlartaudioagentx1roluwb][0m
[0m[1mazurerm_storage_container.prompt: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/blobServices/default/containers/prompt][0m
[0m[1mazurerm_role_assignment.storage_backend_contributor: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/providers/Microsoft.Authorization/roleAssignments/bfae844c-6591-8894-c3b7-14bc63ccf7d4][0m
[0m[1mazurerm_role_assignment.storage_principal_reader: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/providers/Microsoft.Authorization/roleAssignments/b801ece1-0157-530c-db03-13b88b45246e][0m
[0m[1mazurerm_role_assignment.storage_principal_contributor: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/providers/Microsoft.Authorization/roleAssignments/c13428b9-97be-7be0-3b97-b3a9dba44d26][0m
[0m[1mazurerm_storage_container.audioagent: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/blobServices/default/containers/audioagent][0m
[0m[1mazurerm_role_assignment.acs_storage_blob_contributor: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Storage/storageAccounts/stx1roluwb/providers/Microsoft.Authorization/roleAssignments/eace05d5-75e6-1f2f-524c-b6317a0d0296][0m
[0m[1mmodule.appconfig.azurerm_role_assignment.deployer_owner: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.AppConfiguration/configurationStores/appconfig-staging-x1roluwb/providers/Microsoft.Authorization/roleAssignments/18b49b59-dee4-e07b-c97f-902a98e99bd6][0m
[0m[1mmodule.appconfig.azurerm_role_assignment.backend_reader: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.AppConfiguration/configurationStores/appconfig-staging-x1roluwb/providers/Microsoft.Authorization/roleAssignments/66522f69-6402-2655-96e7-41f2af1c6390][0m
[0m[1mmodule.appconfig.azurerm_role_assignment.appconfig_keyvault: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.KeyVault/vaults/kv-x1roluwb/providers/Microsoft.Authorization/roleAssignments/23d3e30a-1ab8-80b2-4d35-2ac40375772c][0m
[0m[1mmodule.appconfig.azurerm_role_assignment.frontend_reader: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.AppConfiguration/configurationStores/appconfig-staging-x1roluwb/providers/Microsoft.Authorization/roleAssignments/1c96731d-f36c-6cc8-cd84-770cdd39217c][0m
[0m[1mazurerm_role_assignment.app_insights_metrics_custom: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb/providers/Microsoft.Authorization/roleAssignments/d7a29e7d-076d-6d0a-b8e7-a7a6da463588][0m
[0m[1mazurerm_role_assignment.app_insights_metrics_frontend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb/providers/Microsoft.Authorization/roleAssignments/4b0527ed-4fbf-456c-341a-eba7c35231e9][0m
[0m[1mazurerm_role_assignment.app_insights_metrics_backend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb/providers/Microsoft.Authorization/roleAssignments/a6c45437-2624-8176-fbba-d61a3ccd20d7][0m
[0m[1mazurerm_container_app.backend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/containerApps/artaudioagent-backend-x1roluwb][0m
[0m[1mazurerm_container_app.frontend: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/containerApps/artaudioagent-frontend-x1roluwb][0m
[0m[1mazurerm_role_assignment.backend_metrics_publisher_system: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb/providers/Microsoft.Authorization/roleAssignments/9af4747a-a14e-0894-bb58-b8bfdadb76cc][0m
[0m[1mazurerm_role_assignment.frontend_metrics_publisher_system: Refreshing state... [id=/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb/providers/Microsoft.Authorization/roleAssignments/f9d401db-668e-08a6-6181-cea4053c63d8][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azapi_resource.mongo_cluster_info[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azapi_resource" "mongo_cluster_info" {
      [32m+[0m[0m exists      = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m identity    = (known after apply)
      [32m+[0m[0m location    = (known after apply)
      [32m+[0m[0m name        = "cosmos-cluster-x1roluwb"
      [32m+[0m[0m output      = (known after apply)
      [32m+[0m[0m parent_id   = (known after apply)
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m tags        = (known after apply)
      [32m+[0m[0m type        = "Microsoft.DocumentDB/mongoClusters@2025-04-01-preview"
    }

[1m  # data.azapi_resource.redis_enterprise_fetched[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azapi_resource" "redis_enterprise_fetched" {
      [32m+[0m[0m exists      = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m identity    = (known after apply)
      [32m+[0m[0m location    = (known after apply)
      [32m+[0m[0m name        = "redisx1roluwb"
      [32m+[0m[0m output      = (known after apply)
      [32m+[0m[0m parent_id   = (known after apply)
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m tags        = (known after apply)
      [32m+[0m[0m type        = "Microsoft.Cache/redisEnterprise@2024-09-01-preview"
    }

[1m  # azapi_resource.acs[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "acs" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb" -> (known after apply)
      [33m~[0m[0m name                      = "acs-artaudioagent-staging-x1roluwb" [33m->[0m[0m "acs-artagent-staging-x1roluwb" [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb"
          [31m-[0m[0m identity   = {
              [31m-[0m[0m principalId = "d9cac01a-5904-4b2b-a492-f8bb3c4ba9a4"
              [31m-[0m[0m tenantId    = "16b3c013-d300-468d-ac64-7eda0820b6d3"
            }
          [31m-[0m[0m properties = {
              [31m-[0m[0m hostName            = "acs-artaudioagent-staging-x1roluwb.unitedstates.communication.azure.com"
              [31m-[0m[0m immutableResourceId = "dd728d62-937a-408d-98a8-ac80bc1c5ec6"
              [31m-[0m[0m linkedDomains       = [
                  [31m-[0m[0m "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain",
                ]
              [31m-[0m[0m provisioningState   = "Succeeded"
            }
          [31m-[0m[0m tags       = {
              [31m-[0m[0m SecurityControl = "Ignore"
              [31m-[0m[0m azd-env-name    = "staging"
              [31m-[0m[0m deployed_by     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
              [31m-[0m[0m deployment      = "terraform"
              [31m-[0m[0m environment     = "staging"
              [31m-[0m[0m hidden-title    = "Real Time Audio staging"
              [31m-[0m[0m project         = "gbb-ai-audio-agent"
            }
          [31m-[0m[0m type       = "microsoft.communication/communicationservices"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        tags                      = {
            "SecurityControl" = "Ignore"
            "azd-env-name"    = "staging"
            "deployed_by"     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"      = "terraform"
            "environment"     = "staging"
            "hidden-title"    = "Real Time Audio staging"
            "project"         = "gbb-ai-audio-agent"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m principal_id = "d9cac01a-5904-4b2b-a492-f8bb3c4ba9a4" -> (known after apply)
          [33m~[0m[0m tenant_id    = "16b3c013-d300-468d-ac64-7eda0820b6d3" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # azapi_resource.backendRedisUser[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "backendRedisUser" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m user             = {
                  [33m~[0m[0m objectId = "7ce170e7-9b96-460d-b073-2ee67b3c4ef2" -> (known after apply)
                }
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/backendaccess" -> (known after apply)
      [32m+[0m[0m location                  = (known after apply)
        name                      = "backendaccess"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/backendaccess"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
            }
          [31m-[0m[0m type       = "Microsoft.Cache/redisEnterprise/databases/accessPolicyAssignments"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m tags                      = (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.cosmos_backend_db_user[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "cosmos_backend_db_user" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/7ce170e7-9b96-460d-b073-2ee67b3c4ef2" -> (known after apply)
      [33m~[0m[0m name                      = "7ce170e7-9b96-460d-b073-2ee67b3c4ef2" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/7ce170e7-9b96-460d-b073-2ee67b3c4ef2"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
              [31m-[0m[0m roles             = [
                  [31m-[0m[0m {},
                ]
            }
          [31m-[0m[0m type       = "Microsoft.DocumentDB/mongoClusters/users"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.cosmos_principal_user[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "cosmos_principal_user" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m identityProvider = {
                  [33m~[0m[0m properties = {
                      [33m~[0m[0m principalType = "ServicePrincipal" [33m->[0m[0m "User"
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/2c0711ae-679a-4a27-8360-a821120d8da1" -> (known after apply)
        name                      = "2c0711ae-679a-4a27-8360-a821120d8da1"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/users/2c0711ae-679a-4a27-8360-a821120d8da1"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
              [31m-[0m[0m roles             = [
                  [31m-[0m[0m {},
                ]
            }
          [31m-[0m[0m type       = "Microsoft.DocumentDB/mongoClusters/users"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.mongoCluster[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "mongoCluster" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb" -> (known after apply)
        name                      = "cosmos-cluster-x1roluwb"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb"
          [31m-[0m[0m properties = {
              [31m-[0m[0m authConfig            = {
                  [31m-[0m[0m allowedModes = [
                      [31m-[0m[0m "MicrosoftEntraID",
                      [31m-[0m[0m "NativeAuth",
                    ]
                }
              [31m-[0m[0m backup                = {
                  [31m-[0m[0m earliestRestoreTime = "2025-12-12T03:08:31Z"
                }
              [31m-[0m[0m clusterStatus         = "Ready"
              [31m-[0m[0m connectionString      = "mongodb+srv://<user>:<password>@cosmos-cluster-x1roluwb.mongocluster.cosmos.azure.com/?tls=true&authMechanism=SCRAM-SHA-256&retrywrites=false&maxIdleTimeMS=120000"
              [31m-[0m[0m infrastructureVersion = "2.0"
              [31m-[0m[0m provisioningState     = "Succeeded"
              [31m-[0m[0m replica               = {
                  [31m-[0m[0m replicationState = "Active"
                  [31m-[0m[0m role             = "Primary"
                }
            }
          [31m-[0m[0m tags       = {
              [31m-[0m[0m SecurityControl = "Ignore"
              [31m-[0m[0m azd-env-name    = "staging"
              [31m-[0m[0m deployed_by     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
              [31m-[0m[0m deployment      = "terraform"
              [31m-[0m[0m environment     = "staging"
              [31m-[0m[0m hidden-title    = "Real Time Audio staging"
              [31m-[0m[0m project         = "gbb-ai-audio-agent"
            }
          [31m-[0m[0m type       = "Microsoft.DocumentDB/mongoClusters"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        tags                      = {
            "SecurityControl" = "Ignore"
            "azd-env-name"    = "staging"
            "deployed_by"     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"      = "terraform"
            "environment"     = "staging"
            "hidden-title"    = "Real Time Audio staging"
            "project"         = "gbb-ai-audio-agent"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.mongo_firewall_all[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "mongo_firewall_all" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/firewallRules/allowAll" -> (known after apply)
        name                      = "allowAll"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb/firewallRules/allowAll"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
            }
          [31m-[0m[0m type       = "Microsoft.DocumentDB/mongoClusters/firewallRules"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.DocumentDB/mongoClusters/cosmos-cluster-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.principalRedisUser[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "principalRedisUser" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/principalaccess" -> (known after apply)
        name                      = "principalaccess"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default/accessPolicyAssignments/principalaccess"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
            }
          [31m-[0m[0m type       = "Microsoft.Cache/redisEnterprise/databases/accessPolicyAssignments"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.redisDatabase[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "redisDatabase" {
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default" -> (known after apply)
        name                      = "default"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb/databases/default"
          [31m-[0m[0m properties = {
              [31m-[0m[0m provisioningState = "Succeeded"
              [31m-[0m[0m redisVersion      = "7.4"
              [31m-[0m[0m resourceState     = "Running"
            }
          [31m-[0m[0m type       = "Microsoft.Cache/redisEnterprise/databases"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.redisEnterprise[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "redisEnterprise" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m highAvailability  = "Disabled" [33m->[0m[0m "Enabled"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [33m~[0m[0m id                        = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb" -> (known after apply)
        name                      = "redisx1roluwb"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Cache/redisEnterprise/redisx1roluwb"
          [31m-[0m[0m kind       = "v2"
          [31m-[0m[0m properties = {
              [31m-[0m[0m hostName          = "redisx1roluwb.eastus.redis.azure.net"
              [31m-[0m[0m provisioningState = "Succeeded"
              [31m-[0m[0m redundancyMode    = "None"
              [31m-[0m[0m resourceState     = "Running"
            }
          [31m-[0m[0m tags       = {
              [31m-[0m[0m SecurityControl = "Ignore"
              [31m-[0m[0m azd-env-name    = "staging"
              [31m-[0m[0m deployed_by     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
              [31m-[0m[0m deployment      = "terraform"
              [31m-[0m[0m environment     = "staging"
              [31m-[0m[0m hidden-title    = "Real Time Audio staging"
              [31m-[0m[0m project         = "gbb-ai-audio-agent"
            }
          [31m-[0m[0m type       = "Microsoft.Cache/redisEnterprise"
        } -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        tags                      = {
            "SecurityControl" = "Ignore"
            "azd-env-name"    = "staging"
            "deployed_by"     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"      = "terraform"
            "environment"     = "staging"
            "hidden-title"    = "Real Time Audio staging"
            "project"         = "gbb-ai-audio-agent"
        }
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource_action.acs_list_keys[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource_action" "acs_list_keys" {
      [33m~[0m[0m id                     = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb/listKeys" -> (known after apply)
      [33m~[0m[0m output                 = {
          [31m-[0m[0m primary_connection_string = "endpoint=https://acs-artaudioagent-staging-x1roluwb.unitedstates.communication.azure.com/;accesskey=7BeYEPtfsRXovCqgtv6YuXIKl7AIuTajMhgFpKYbDF9mvcrxXXGGJQQJ99BLACULyCpJ0deGAAAAAZCSAJFr"
        } -> (known after apply)
      [33m~[0m[0m resource_id            = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m sensitive_output       = (sensitive value)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_application_insights.main[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_application_insights" "main" {
      [33m~[0m[0m app_id                                = "00388acc-c874-431b-9ed9-c4b9f1b23716" -> (known after apply)
      [33m~[0m[0m connection_string                     = (sensitive value)
      [31m-[0m[0m daily_data_cap_notifications_disabled = false [90m-> null[0m[0m
      [33m~[0m[0m id                                    = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Insights/components/ai-x1roluwb" -> (known after apply)
      [33m~[0m[0m instrumentation_key                   = (sensitive value)
        name                                  = "ai-x1roluwb"
      [33m~[0m[0m resource_group_name                   = "rg-artaudioagent-staging" [33m->[0m[0m "rg-artagent-staging" [31m# forces replacement[0m[0m
        tags                                  = {
            "SecurityControl" = "Ignore"
            "azd-env-name"    = "staging"
            "deployed_by"     = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"      = "terraform"
            "environment"     = "staging"
            "hidden-title"    = "Real Time Audio staging"
            "project"         = "gbb-ai-audio-agent"
        }
      [33m~[0m[0m workspace_id                          = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.OperationalInsights/workspaces/log-x1roluwb" -> (known after apply)
        [90m# (10 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_communication_service_email_domain_association.example[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_communication_service_email_domain_association" "example" {
      [33m~[0m[0m communication_service_id = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m email_service_domain_id  = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id                       = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/communicationServices/acs-artaudioagent-staging-x1roluwb|/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.Communication/emailServices/email-artaudioagent-staging-x1roluwb/domains/AzureManagedDomain" -> (known after apply)
    }

[1m  # azurerm_container_app.backend[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_app" "backend" {
      [33m~[0m[0m container_app_environment_id  = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/managedEnvironments/cae-artaudioagent-staging-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m custom_domain_verification_id = (sensitive value)
      [33m~[0m[0m id                            = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/containerApps/artaudioagent-backend-x1roluwb" -> (known after apply)
      [33m~[0m[0m latest_revision_fqdn          = "artaudioagent-backend-x1roluwb--azd-1766695215.victoriousdune-7a5dae29.eastus.azurecontainerapps.io" -> (known after apply)
      [33m~[0m[0m latest_revision_name          = "artaudioagent-backend-x1roluwb--azd-1766695215" -> (known after apply)
      [33m~[0m[0m location                      = "eastus" -> (known after apply)
      [31m-[0m[0m max_inactive_revisions        = 0 [90m-> null[0m[0m
      [33m~[0m[0m name                          = "artaudioagent-backend-x1roluwb" [33m->[0m[0m "artagent-backend-x1roluwb" [31m# forces replacement[0m[0m
      [33m~[0m[0m outbound_ip_addresses         = [
          [31m-[0m[0m "48.194.104.39",
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "rg-artaudioagent-staging" [33m->[0m[0m "rg-artagent-staging" [31m# forces replacement[0m[0m
        tags                          = {
            "SecurityControl"  = "Ignore"
            "azd-env-name"     = "staging"
            "azd-service-name" = "rtaudio-server"
            "deployed_by"      = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"       = "terraform"
            "environment"      = "staging"
            "hidden-title"     = "Real Time Audio staging"
            "project"          = "gbb-ai-audio-agent"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m identity_ids = [
              [31m-[0m[0m "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-backend-x1roluwb",
            ] -> (known after apply)
          [33m~[0m[0m principal_id = "57bd23d0-d7e4-4f65-a602-4acfda022811" -> (known after apply)
          [33m~[0m[0m tenant_id    = "16b3c013-d300-468d-ac64-7eda0820b6d3" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m ingress {
          [33m~[0m[0m custom_domain              = [] -> (known after apply)
          [31m-[0m[0m exposed_port               = 0 [90m-> null[0m[0m
          [33m~[0m[0m fqdn                       = "artaudioagent-backend-x1roluwb.victoriousdune-7a5dae29.eastus.azurecontainerapps.io" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m[0m registry {
          [33m~[0m[0m identity             = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-backend-x1roluwb" -> (known after apply)
          [33m~[0m[0m server               = "crartaudioagentx1roluwb.azurecr.io" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

      [33m~[0m[0m template {
          [33m~[0m[0m revision_suffix                  = "azd-1766695215" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m container {
              [31m-[0m[0m args              = [] [90m-> null[0m[0m
              [31m-[0m[0m command           = [] [90m-> null[0m[0m
              [33m~[0m[0m ephemeral_storage = "8Gi" -> (known after apply)
              [33m~[0m[0m image             = "crartaudioagentx1roluwb.azurecr.io/art-voice-agent-accelerator/rtaudio-server-staging:azd-deploy-1766695113" [33m->[0m[0m "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              [33m~[0m[0m memory            = "4Gi" [33m->[0m[0m "4.0Gi"
                name              = "main"
                [90m# (1 unchanged attribute hidden)[0m[0m

              [33m~[0m[0m env {
                    name        = "AZURE_APPCONFIG_ENDPOINT"
                  [33m~[0m[0m value       = "https://appconfig-staging-x1roluwb.azconfig.io" -> (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
              [33m~[0m[0m env {
                    name        = "AZURE_CLIENT_ID"
                  [33m~[0m[0m value       = "1f99d1d0-cf15-4fcc-920d-d5a26898776c" -> (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
              [33m~[0m[0m env {
                    name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  # [33mWarning[0m: this attribute value will no longer be marked as sensitive
                  # after applying this change.[0m
                  [33m~[0m[0m value       = (sensitive value)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }

                [90m# (3 unchanged blocks hidden)[0m[0m
            }
        }
    }

[1m  # azurerm_container_app.frontend[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_app" "frontend" {
      [33m~[0m[0m container_app_environment_id  = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/managedEnvironments/cae-artaudioagent-staging-x1roluwb" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m custom_domain_verification_id = (sensitive value)
      [33m~[0m[0m id                            = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/containerApps/artaudioagent-frontend-x1roluwb" -> (known after apply)
      [33m~[0m[0m latest_revision_fqdn          = "artaudioagent-frontend-x1roluwb--azd-1766695095.victoriousdune-7a5dae29.eastus.azurecontainerapps.io" -> (known after apply)
      [33m~[0m[0m latest_revision_name          = "artaudioagent-frontend-x1roluwb--azd-1766695095" -> (known after apply)
      [33m~[0m[0m location                      = "eastus" -> (known after apply)
      [31m-[0m[0m max_inactive_revisions        = 0 [90m-> null[0m[0m
      [33m~[0m[0m name                          = "artaudioagent-frontend-x1roluwb" [33m->[0m[0m "artagent-frontend-x1roluwb" [31m# forces replacement[0m[0m
      [33m~[0m[0m outbound_ip_addresses         = [
          [31m-[0m[0m "48.194.104.39",
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "rg-artaudioagent-staging" [33m->[0m[0m "rg-artagent-staging" [31m# forces replacement[0m[0m
        tags                          = {
            "SecurityControl"  = "Ignore"
            "azd-env-name"     = "staging"
            "azd-service-name" = "rtaudio-client"
            "deployed_by"      = "dd5f1dbd-8dbd-46f3-8aa6-d6eddf92c938"
            "deployment"       = "terraform"
            "environment"      = "staging"
            "hidden-title"     = "Real Time Audio staging"
            "project"          = "gbb-ai-audio-agent"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m identity_ids = [
              [31m-[0m[0m "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-frontend-x1roluwb",
            ] -> (known after apply)
          [33m~[0m[0m principal_id = "c1657baf-e4ec-4d3d-a284-3d62cf52326a" -> (known after apply)
          [33m~[0m[0m tenant_id    = "16b3c013-d300-468d-ac64-7eda0820b6d3" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m ingress {
          [33m~[0m[0m custom_domain              = [] -> (known after apply)
          [31m-[0m[0m exposed_port               = 0 [90m-> null[0m[0m
          [33m~[0m[0m fqdn                       = "artaudioagent-frontend-x1roluwb.victoriousdune-7a5dae29.eastus.azurecontainerapps.io" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m[0m registry {
          [33m~[0m[0m identity             = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/artaudioagent-frontend-x1roluwb" -> (known after apply)
          [33m~[0m[0m server               = "crartaudioagentx1roluwb.azurecr.io" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

      [33m~[0m[0m template {
          [33m~[0m[0m revision_suffix                  = "azd-1766695095" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m container {
              [31m-[0m[0m args              = [] [90m-> null[0m[0m
              [31m-[0m[0m command           = [] [90m-> null[0m[0m
              [33m~[0m[0m ephemeral_storage = "2Gi" -> (known after apply)
              [33m~[0m[0m image             = "crartaudioagentx1roluwb.azurecr.io/art-voice-agent-accelerator/rtaudio-client-staging:azd-deploy-1766694982" [33m->[0m[0m "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              [33m~[0m[0m memory            = "1Gi" [33m->[0m[0m "1.0Gi"
                name              = "main"
                [90m# (1 unchanged attribute hidden)[0m[0m

              [33m~[0m[0m env {
                    name        = "AZURE_APPCONFIG_ENDPOINT"
                  [33m~[0m[0m value       = "https://appconfig-staging-x1roluwb.azconfig.io" -> (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
              [33m~[0m[0m env {
                    name        = "AZURE_CLIENT_ID"
                  [33m~[0m[0m value       = "5c8fd1e2-a4bf-4d8b-84fb-13604b3f65e8" -> (known after apply)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
              [33m~[0m[0m env {
                    name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  # [33mWarning[0m: this attribute value will no longer be marked as sensitive
                  # after applying this change.[0m
                  [33m~[0m[0m value       = (sensitive value)
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }

                [90m# (2 unchanged blocks hidden)[0m[0m
            }
        }
    }

[1m  # azurerm_container_app_environment.main[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_app_environment" "main" {
      [33m~[0m[0m custom_domain_verification_id               = "BD96EB27E71B378F4E033CBA61E4B4A0C4A6F5A853DBDB3282FF135501EFA08A" -> (known after apply)
      [33m~[0m[0m default_domain                              = "victoriousdune-7a5dae29.eastus.azurecontainerapps.io" -> (known after apply)
      [32m+[0m[0m docker_bridge_cidr                          = (known after apply)
      [33m~[0m[0m id                                          = "/subscriptions/46c8d580-4e4e-43b3-b3db-4a2daea037b1/resourceGroups/rg-artaudioagent-staging/providers/Microsoft.App/managedEnvironments/cae-artaudioagent-s
...[truncated]
```
</details>